[
 {
  "ID": 1,
  "space_ID": 1,
  "title": "Musical Fridays Announcement",
  "description": "Don't miss out on this week's Musical Fridays! We'll be featuring some new songs and special guest performers."
 },
 {
  "ID": 2,
  "space_ID": 1,
  "title": "Photos from Last Week's Musical Fridays",
  "description": "Check out these pictures from our last Musical Fridays event! Thanks to everyone who came out and made it a great night."
 },
 {
  "ID": 3,
  "space_ID": 1,
  "title": "Karaoke Competition",
  "description": "We're hosting a karaoke competition at Musical Fridays next week. Come show off your skills and compete for a prize!"
 },
 {
  "ID": 4,
  "space_ID": 1,
  "title": "Musical Fridays Cancelled",
  "description": "Unfortunately, we have to cancel this week's Musical Fridays due to unforeseen circumstances. Stay tuned for updates on when we'll be back up and running!"
 },
 {
  "ID": 5,
  "space_ID": 1,
  "title": "Reminder: Musical Fridays Tonight!",
  "description": "Just a friendly reminder that Musical Fridays is happening tonight. Come join us for some great music and good times!"
 },
 {
  "ID": 6,
  "space_ID": 1,
  "title": "Musical Fridays Playlist Update",
  "description": "We've updated the Musical Fridays playlist with some new songs and old favorites. Check it out and let us know what you think!"
 },
 {
  "ID": 7,
  "space_ID": 1,
  "title": "Volunteers Needed for Musical Fridays",
  "description": "We're looking for volunteers to help out with Musical Fridays. If you're interested in helping set up or run the event, please let us know!"
 },
 {
  "ID": 8,
  "space_ID": 1,
  "title": "Recap: Last Month's Musical Fridays",
  "description": "In case you missed it, here's a recap of last month's Musical Fridays event. We had a great turnout and some amazing performances!"
 },
 {
  "ID": 9,
  "space_ID": 1,
  "title": "Musical Fridays Moving to New Location",
  "description": "Starting next month, Musical Fridays will be moving to a new location. Stay tuned for more details and directions!"
 },
 {
  "ID": 10,
  "space_ID": 2,
  "title": "Upcoming Cooking Class: Pasta Making",
  "description": "Join us for our upcoming cooking class where we'll be making homemade pasta from scratch! Don't miss out on this opportunity to learn a new skill and enjoy some delicious food."
 },
 {
  "ID": 11,
  "space_ID": 2,
  "title": "Cookies Galore!",
  "description": "We're having a cookie-making extravaganza at our next cooking class. Learn how to make all your favorite types of cookies and take home a box of treats to share with your friends and family."
 },
 {
  "ID": 12,
  "space_ID": 2,
  "title": "Bread Baking 101",
  "description": "In this beginner-friendly class, we'll teach you everything you need to know about making homemade bread. From sourdough to focaccia, you'll leave with the confidence to tackle any bread recipe."
 },
 {
  "ID": 13,
  "space_ID": 2,
  "title": "Cooking Class Cancelled",
  "description": "Due to unforeseen circumstances, we have to cancel this week's cooking class. We apologize for any inconvenience and will be back with more classes soon!"
 },
 {
  "ID": 14,
  "space_ID": 2,
  "title": "Summer Grilling Workshop",
  "description": "Get ready for summer with our grilling workshop! We'll cover everything from marinades to cooking temperatures to make sure your BBQs are a hit."
 },
 {
  "ID": 15,
  "space_ID": 2,
  "title": "Vegetarian Cooking Class",
  "description": "In this class, we'll focus on delicious and healthy vegetarian meals. Whether you're a lifelong vegetarian or just looking to incorporate more plant-based meals into your diet, you'll leave feeling satisfied and inspired."
 },
 {
  "ID": 16,
  "space_ID": 2,
  "title": "Baking with Chocolate: A Decadent Experience",
  "description": "Join us for a chocolate-themed baking class where we'll make everything from brownies to truffles to chocolate lava cakes. Warning: this class is not for the faint of heart (or those with a dairy allergy)."
 },
 {
  "ID": 17,
  "space_ID": 2,
  "title": "Cooking Class Feedback Request",
  "description": "We want to hear from you! If you've attended one of our cooking classes, please take a few minutes to fill out our feedback form. Your input will help us improve our classes and create the best possible experience for our students."
 },
 {
  "ID": 18,
  "space_ID": 2,
  "title": "Kitchen Basics: Knife Skills",
  "description": "In this class, we'll cover all the basics of knife skills, including how to choose the right knife, how to hold and use it safely, and how to slice and dice like a pro. Whether you're a beginner or a seasoned cook, this class is sure to be informative and fun."
 },
 {
  "ID": 19,
  "space_ID": 3,
  "title": "Study Group: Algorithms and Data Structures",
  "description": "Join us for a weekly study group focused on algorithms and data structures. We'll review concepts and work through practice problems together. All levels welcome!"
 },
 {
  "ID": 20,
  "space_ID": 3,
  "title": "Internship Opportunities",
  "description": "Our members have shared some great internship opportunities for computer science students. Check them out and apply today!"
 },
 {
  "ID": 21,
  "space_ID": 3,
  "title": "Meet the Professors",
  "description": "We're hosting an event where you can meet and network with some of the computer science professors at our university. Don't miss out on this opportunity to connect and learn more about the department."
 },
 {
  "ID": 22,
  "space_ID": 3,
  "title": "Advice for Freshman CS Majors",
  "description": "Our senior members have shared some helpful tips and advice for incoming freshman computer science majors. Check it out and start your journey off on the right foot."
 },
 {
  "ID": 23,
  "space_ID": 3,
  "title": "Group Project: Build a Web Application",
  "description": "We're forming a group to build a web application for our final project. If you're interested in web development and want to work on a real-world project, join us!"
 },
 {
  "ID": 24,
  "space_ID": 3,
  "title": "Resource Sharing",
  "description": "Have you found a great resource for studying computer science or related subjects? Share it with the group so we can all benefit!"
 },
 {
  "ID": 25,
  "space_ID": 3,
  "title": "Internship Interview Prep",
  "description": "Are you preparing for a computer science internship interview? Join us for a workshop where we'll cover common interview questions and how to best prepare for them."
 },
 {
  "ID": 26,
  "space_ID": 3,
  "title": "Code Review and Feedback",
  "description": "Share your code with the group and get feedback from your peers. We'll review each other's work and offer suggestions for improvement."
 },
 {
  "ID": 27,
  "space_ID": 4,
  "title": "Residence Meet and Greet",
  "description": "Let's get to know each other! Come to our meet and greet event and meet your fellow first-year residents. We'll have games and snacks, and it's a great opportunity to make some new friends."
 },
 {
  "ID": 28,
  "space_ID": 4,
  "title": "Study Group: Math 135",
  "description": "Join our weekly study group for Math 135. We'll review concepts, work through practice problems, and help each other succeed in the course. All levels welcome!"
 },
 {
  "ID": 29,
  "space_ID": 4,
  "title": "Movie Night",
  "description": "Join us for a movie night in the common room. We'll have popcorn and snacks, and it's a great opportunity to relax and unwind with your fellow residents."
 },
 {
  "ID": 30,
  "space_ID": 4,
  "title": "Residence Kitchen Basics",
  "description": "Are you new to cooking? Join us for a workshop where we'll cover kitchen basics like knife skills, cooking techniques, and meal planning. You'll leave with the skills to make your own delicious meals in your residence kitchen."
 },
 {
  "ID": 31,
  "space_ID": 4,
  "title": "First-Year Tips and Tricks",
  "description": "Our senior members have shared some tips and tricks for surviving and thriving in your first year of university. Check it out and start your year off on the right foot."
 },
 {
  "ID": 32,
  "space_ID": 4,
  "title": "Game Night",
  "description": "Join us for a fun game night in the common room. We'll have board games and card games, and it's a great opportunity to hang out and make some new friends."
 },
 {
  "ID": 33,
  "space_ID": 4,
  "title": "Roommate Meet and Greet",
  "description": "If you haven't met your roommate yet, come to our roommate meet and greet event. We'll have icebreakers and snacks, and it's a great opportunity to get to know the person you'll be living with for the next year."
 },
 {
  "ID": 34,
  "space_ID": 4,
  "title": "Residence Decorating Workshop",
  "description": "Want to make your room feel more like home? Join us for a decorating workshop where we'll share tips and ideas for making your residence room cozy and comfortable."
 },
 {
  "ID": 35,
  "space_ID": 4,
  "title": "Residence Foodie Club",
  "description": "Do you love to cook or bake? Join our foodie club and share recipes and meal ideas with your fellow residents. We'll also have potluck dinners and food-related events throughout the year."
 },
 {
  "ID": 36,
  "space_ID": 4,
  "title": "Residence Fitness Challenge",
  "description": "Join our fitness challenge and get in shape with your fellow residents. We'll have weekly challenges and workouts, and it's a great way to stay motivated and have fun while staying active."
 },
 {
  "ID": 37,
  "space_ID": 5,
  "title": "Guest Speaker: Sheryl Sandberg",
  "description": "Join us for a talk with Sheryl Sandberg, COO of Facebook and author of Lean In. She'll share her experiences and insights on leadership, diversity, and women in tech."
 },
 {
  "ID": 38,
  "space_ID": 5,
  "title": "Tech Talk: Data Science",
  "description": "Come to our tech talk on data science and learn about machine learning, data visualization, and more. Our guest speaker is a data scientist at a leading tech company, and they'll share their expertise and answer your questions."
 },
 {
  "ID": 39,
  "space_ID": 5,
  "title": "Coding Bootcamp",
  "description": "Join our coding bootcamp and learn how to code from scratch. We'll cover programming fundamentals, web development, and more. All levels welcome!"
 },
 {
  "ID": 40,
  "space_ID": 5,
  "title": "Mentorship Program",
  "description": "Looking for a mentor in tech? Join our mentorship program and connect with experienced professionals who can offer guidance and support."
 },
 {
  "ID": 41,
  "space_ID": 5,
  "title": "Networking Night",
  "description": "Join us for a networking night and meet other women in tech. We'll have refreshments and activities to help you make connections and expand your professional circle."
 },
 {
  "ID": 42,
  "space_ID": 5,
  "title": "Tech Careers Workshop",
  "description": "Are you interested in a career in tech? Come to our workshop and learn about different roles in the industry, what skills you need to succeed, and how to land your dream job."
 },
 {
  "ID": 43,
  "space_ID": 5,
  "title": "Panel Discussion: Women in Leadership",
  "description": "Join us for a panel discussion on women in leadership. Our panelists are CEOs, VPs, and directors at leading tech companies, and they'll share their experiences and insights on breaking the glass ceiling and succeeding in the industry."
 },
 {
  "ID": 44,
  "space_ID": 5,
  "title": "Hackathon",
  "description": "Join our hackathon and work on a project with other women in tech. We'll have prizes for the best projects, and it's a great opportunity to apply your skills and collaborate with others."
 },
 {
  "ID": 45,
  "space_ID": 5,
  "title": "Tech Book Club",
  "description": "Join our tech book club and discuss books on tech topics like AI, cybersecurity, and entrepreneurship. We'll meet regularly to discuss books and share our insights and opinions."
 },
 {
  "ID": 46,
  "space_ID": 5,
  "title": "Resume Workshop",
  "description": "Need help with your resume? Come to our workshop and get feedback and advice from experienced professionals. We'll cover best practices, common mistakes, and how to make your resume stand out in the tech industry."
 },
 {
  "ID": 47,
  "space_ID": 6,
  "title": "Hiking Adventure",
  "description": "Join us for a weekend hiking trip in the mountains. We'll explore beautiful trails and enjoy stunning views. All levels welcome!"
 },
 {
  "ID": 48,
  "space_ID": 6,
  "title": "Photography Workshop",
  "description": "Are you interested in nature photography? Come to our workshop and learn how to capture beautiful landscapes, wildlife, and more. Our guest speaker is a professional nature photographer, and they'll share their tips and tricks."
 },
 {
  "ID": 49,
  "space_ID": 6,
  "title": "Bird Watching Tour",
  "description": "Join our bird watching tour and spot different bird species in their natural habitats. Our guide is an experienced bird watcher, and they'll share their knowledge and answer your questions."
 },
 {
  "ID": 50,
  "space_ID": 6,
  "title": "Nature Conservation Talk",
  "description": "Come to our talk on nature conservation and learn about environmental issues like climate change, deforestation, and habitat loss. Our guest speaker is an expert in the field, and they'll share their insights and solutions."
 },
 {
  "ID": 51,
  "space_ID": 6,
  "title": "Wildlife Documentary Screening",
  "description": "Join us for a screening of a wildlife documentary and learn about different animal species and their behaviors. We'll have snacks and a discussion afterwards."
 },
 {
  "ID": 52,
  "space_ID": 6,
  "title": "Camping Trip",
  "description": "Join us for a camping trip in a beautiful national park. We'll have campfires, s'mores, and outdoor activities. All levels welcome!"
 },
 {
  "ID": 53,
  "space_ID": 6,
  "title": "Nature Walk",
  "description": "Come to our nature walk and explore a local park. We'll observe different plants and animals, and learn about their habitats and behaviors. All ages welcome!"
 },
 {
  "ID": 54,
  "space_ID": 6,
  "title": "Tree Planting Volunteer Day",
  "description": "Join us for a tree planting volunteer day and help us restore a local forest. We'll provide all the necessary tools and training."
 },
 {
  "ID": 55,
  "space_ID": 6,
  "title": "Botany Workshop",
  "description": "Are you interested in learning about different plant species? Come to our botany workshop and learn about plant anatomy, identification, and more. Our guest speaker is a botanist, and they'll share their expertise."
 },
 {
  "ID": 56,
  "space_ID": 6,
  "title": "Nature Writing Workshop",
  "description": "Join our nature writing workshop and learn how to write about the natural world. We'll cover different writing styles, techniques, and exercises. Our guest speaker is a nature writer, and they'll share their insights and advice."
 },
 {
  "ID": 57,
  "space_ID": 7,
  "title": "League Schedule Update",
  "description": "The new schedule for the soccer league is now available. Please check the attached file for details."
 },
 {
  "ID": 58,
  "space_ID": 7,
  "title": "Game Results Update",
  "description": "Congratulations to all the teams who played this weekend! Please check the attached file for the latest game results."
 },
 {
  "ID": 59,
  "space_ID": 7,
  "title": "Referee Training Session",
  "description": "We're organizing a training session for referees. If you're interested in becoming a referee or if you're already a referee and want to improve your skills, please join us."
 },
 {
  "ID": 60,
  "space_ID": 7,
  "title": "Game Rescheduling Request",
  "description": "If your team needs to reschedule a game, please email us as soon as possible with your preferred date and time. We'll do our best to accommodate your request."
 },
 {
  "ID": 61,
  "space_ID": 7,
  "title": "League Standings Update",
  "description": "The latest standings for the soccer league are now available. Please check the attached file for details."
 },
 {
  "ID": 62,
  "space_ID": 7,
  "title": "Volunteer Opportunity",
  "description": "We need volunteers to help with setting up and taking down fields, managing equipment, and more. If you're interested in volunteering, please email us."
 },
 {
  "ID": 63,
  "space_ID": 7,
  "title": "Player Injury Update",
  "description": "We hope all injured players are recovering well. If you have an injury and need support or advice on how to recover, please reach out to us. We can connect you with resources and support."
 },
 {
  "ID": 64,
  "space_ID": 7,
  "title": "League Expansion Survey",
  "description": "We're considering expanding the soccer league to include more teams and more games. If you have thoughts or suggestions on this, please complete our survey."
 },
 {
  "ID": 65,
  "space_ID": 7,
  "title": "Team Registration Reminder",
  "description": "Just a friendly reminder to all teams: if you haven't registered yet, please do so as soon as possible. We need your registration to finalize the schedule and prepare for the league."
 },
 {
  "ID": 66,
  "space_ID": 7,
  "title": "Game Day Guidelines",
  "description": "Please review the game day guidelines before your team's next game. They outline important rules and procedures for players, coaches, and referees. Let's make sure everyone has a safe and fun experience."
 },
 {
  "ID": 67,
  "space_ID": 8,
  "title": "Guest speaker next Monday",
  "description": "Hey everyone, we have a guest speaker lined up for Monday!"
 },
 {
  "ID": 68,
  "space_ID": 8,
  "title": "Data Science Workshops",
  "description": "Come join us to learn some new data science techniques!"
 },
 {
  "ID": 69,
  "space_ID": 8,
  "title": "New members welcome",
  "description": "If you're interested in data science, join our club!"
 },
 {
  "ID": 70,
  "space_ID": 8,
  "title": "Data Science Club Meeting",
  "description": "Our next meeting is on Monday at 6 pm, don't miss it!"
 },
 {
  "ID": 71,
  "space_ID": 8,
  "title": "Data Science Seminar",
  "description": "We're hosting a seminar next week, check it out!"
 },
 {
  "ID": 72,
  "space_ID": 8,
  "title": "Data Science Project Collaborate",
  "description": "Anyone interested in collaborating on a project?"
 },
 {
  "ID": 73,
  "space_ID": 8,
  "title": "Data Science Job Opportunities",
  "description": "Check out the latest job opportunities in data science!"
 },
 {
  "ID": 74,
  "space_ID": 8,
  "title": "Python for Data Science",
  "description": "Learn Python for data science with us!"
 },
 {
  "ID": 75,
  "space_ID": 9,
  "title": "Engineering Internship Info",
  "description": "Get the latest info on engineering internships here!"
 },
 {
  "ID": 76,
  "space_ID": 9,
  "title": "Engineering Student Meetup",
  "description": "Let's meet up and discuss engineering topics!"
 },
 {
  "ID": 77,
  "space_ID": 9,
  "title": "Exam Prep Resources",
  "description": "Need help preparing for exams? Check out our resources!"
 },
 {
  "ID": 78,
  "space_ID": 9,
  "title": "Engineering Career Fair",
  "description": "The annual engineering career fair is coming up soon!"
 },
 {
  "ID": 79,
  "space_ID": 9,
  "title": "Engineering Student Awards",
  "description": "Congratulations to the winners of the engineering awards!"
 },
 {
  "ID": 80,
  "space_ID": 9,
  "title": "New Engineering Students Welcome",
  "description": "Welcome to all the new engineering students!"
 },
 {
  "ID": 81,
  "space_ID": 9,
  "title": "Engineering Club Sign-Up",
  "description": "Join one of our many engineering clubs!"
 },
 {
  "ID": 82,
  "space_ID": 9,
  "title": "Engineering Project Collaboration",
  "description": "Anyone interested in collaborating on a project?"
 },
 {
  "ID": 83,
  "space_ID": 10,
  "title": "Graduating Class Meetup",
  "description": "Let's meet up and celebrate our upcoming graduation!"
 },
 {
  "ID": 84,
  "space_ID": 10,
  "title": "Graduating Class Party Planning",
  "description": "Help us plan our end-of-year party!"
 },
 {
  "ID": 85,
  "space_ID": 10,
  "title": "Job Search Resources",
  "description": "Need help finding a job post-graduation? Check out our resources!"
 },
 {
  "ID": 86,
  "space_ID": 10,
  "title": "Alumni Networking Event",
  "description": "Join us for an alumni networking event after graduation!"
 },
 {
  "ID": 87,
  "space_ID": 10,
  "title": "Graduation Ceremony Details",
  "description": "All the details you need to know about the graduation ceremony!"
 },
 {
  "ID": 88,
  "space_ID": 10,
  "title": "Senior Design Project Showcase",
  "description": "Come see our senior design projects at our showcase event!"
 },
 {
  "ID": 89,
  "space_ID": 10,
  "title": "Graduation Speech Submissions",
  "description": "Submit your ideas for the graduation speech!"
 },
 {
  "ID": 90,
  "space_ID": 10,
  "title": "Graduation Photo Session",
  "description": "Sign up for our graduation photo session and capture the memories!"
 },
 {
  "ID": 91,
  "space_ID": 11,
  "title": "Upcoming elections",
  "description": "Learn about the upcoming student association elections and how to vote!"
 },
 {
  "ID": 92,
  "space_ID": 11,
  "title": "Join the advocacy team",
  "description": "Join the student association's advocacy team and make a difference for student rights."
 },
 {
  "ID": 93,
  "space_ID": 11,
  "title": "Meeting minutes",
  "description": "Access minutes from past student association meetings."
 },
 {
  "ID": 94,
  "space_ID": 11,
  "title": "Social events",
  "description": "Find out about upcoming social events organized by the student association."
 },
 {
  "ID": 95,
  "space_ID": 11,
  "title": "Feedback & Suggestions",
  "description": "Share your feedback and suggestions for the student association."
 },
 {
  "ID": 96,
  "space_ID": 11,
  "title": "Fundraising initiatives",
  "description": "Learn about ongoing fundraising initiatives for the student association."
 },
 {
  "ID": 97,
  "space_ID": 11,
  "title": "Academic support resources",
  "description": "Find academic support resources and services available for students."
 },
 {
  "ID": 98,
  "space_ID": 11,
  "title": "Volunteering opportunities",
  "description": "Discover volunteering opportunities with the student association."
 },
 {
  "ID": 99,
  "space_ID": 12,
  "title": "Biology textbook",
  "description": "Selling a gently used Biology textbook"
 },
 {
  "ID": 100,
  "space_ID": 12,
  "title": "Calculus textbook",
  "description": "Looking for a Calculus textbook to buy or trade"
 },
 {
  "ID": 101,
  "space_ID": 12,
  "title": "Chemistry textbook",
  "description": "Free Chemistry textbook available"
 },
 {
  "ID": 102,
  "space_ID": 12,
  "title": "Psychology textbook",
  "description": "In need of a Psychology textbook"
 },
 {
  "ID": 103,
  "space_ID": 12,
  "title": "Physics textbook",
  "description": "Physics textbook for sale"
 },
 {
  "ID": 104,
  "space_ID": 12,
  "title": "History textbook",
  "description": "Looking for a History textbook"
 },
 {
  "ID": 105,
  "space_ID": 12,
  "title": "Math textbook bundle",
  "description": "Selling a bundle of Math textbooks"
 },
 {
  "ID": 106,
  "space_ID": 12,
  "title": "English literature",
  "description": "Free English literature textbook available"
 },
 {
  "ID": 107,
  "space_ID": 13,
  "title": "One-bedroom sublet",
  "description": "Cozy one-bedroom apartment available now"
 },
 {
  "ID": 108,
  "space_ID": 13,
  "title": "Looking for sublet",
  "description": "I'm looking for a room sublet for the summer term"
 },
 {
  "ID": 109,
  "space_ID": 13,
  "title": "Sublet near campus",
  "description": "Spacious room available for sublet from May to August"
 },
 {
  "ID": 110,
  "space_ID": 13,
  "title": "Short-term sublet",
  "description": "Studio sublet available for one month in June"
 },
 {
  "ID": 111,
  "space_ID": 13,
  "title": "Summer sublet",
  "description": "Fully furnished two-bedroom apartment available for the summer term"
 },
 {
  "ID": 112,
  "space_ID": 13,
  "title": "Sublet swap",
  "description": "Looking to swap my sublet for a different location"
 },
 {
  "ID": 113,
  "space_ID": 13,
  "title": "Roommate wanted",
  "description": "Looking for a roommate for a sublet near campus"
 },
 {
  "ID": 114,
  "space_ID": 13,
  "title": "Urgent sublet",
  "description": "Need to find someone to take over my sublet ASAP"
 },
 {
  "ID": 115,
  "space_ID": 14,
  "title": "How to prepare for co-op interviews?",
  "description": "Anyone have tips on how to best prepare for co-op interviews?"
 },
 {
  "ID": 116,
  "space_ID": 14,
  "title": "Good companies for first-time co-ops?",
  "description": "Looking for suggestions on good companies for first-time co-op students"
 },
 {
  "ID": 117,
  "space_ID": 14,
  "title": "Working remotely on co-op?",
  "description": "Has anyone had experience with working remotely on co-op? How was it?"
 },
 {
  "ID": 118,
  "space_ID": 14,
  "title": "Co-op salaries for different industries?",
  "description": "What are typical co-op salaries for different industries?"
 },
 {
  "ID": 119,
  "space_ID": 14,
  "title": "Balancing work and school on co-op?",
  "description": "Struggling to balance work and school on co-op. Any advice?"
 },
 {
  "ID": 120,
  "space_ID": 14,
  "title": "What to do if you don't like your co-op job?",
  "description": "If you don't like your co-op job, what steps can you take to improve your experience?"
 },
 {
  "ID": 121,
  "space_ID": 14,
  "title": "Best ways to network during co-op?",
  "description": "What are some effective ways to network and make connections during co-op?"
 },
 {
  "ID": 122,
  "space_ID": 14,
  "title": "How to make the most of your co-op experience?",
  "description": "Any suggestions on how to make the most of your co-op experience?"
 },
 {
  "ID": 123,
  "space_ID": 15,
  "title": "Looking for a roommate",
  "description": "Looking for a roommate for my coop in California"
 },
 {
  "ID": 124,
  "space_ID": 15,
  "title": "Carpool from San Francisco",
  "description": "Looking for someone to carpool with from San Francisco to my coop"
 },
 {
  "ID": 125,
  "space_ID": 15,
  "title": "Any interns in LA?",
  "description": "Anyone interning in LA and want to meet up?"
 },
 {
  "ID": 126,
  "space_ID": 15,
  "title": "Things to do in San Diego?",
  "description": "What are some fun things to do in San Diego on the weekends?"
 },
 {
  "ID": 127,
  "space_ID": 15,
  "title": "Advice on renting in LA",
  "description": "Any tips on finding affordable housing in Los Angeles?"
 },
 {
  "ID": 128,
  "space_ID": 15,
  "title": "Interning in Silicon Valley",
  "description": "Anyone else interning in Silicon Valley this summer?"
 },
 {
  "ID": 129,
  "space_ID": 15,
  "title": "Best beaches in Southern California?",
  "description": "What are some of the best beaches in Southern California?"
 },
 {
  "ID": 130,
  "space_ID": 15,
  "title": "Coop interview prep",
  "description": "Looking for tips on how to prepare for a coop interview in California"
 },
 {
  "ID": 131,
  "space_ID": 16,
  "title": "Study Tips for Kinesiology Students",
  "description": "Share study tips and resources for Kinesiology courses"
 },
 {
  "ID": 132,
  "space_ID": 16,
  "title": "Career Opportunities in Kinesiology",
  "description": "Discuss career options and opportunities for Kinesiology graduates"
 },
 {
  "ID": 133,
  "space_ID": 16,
  "title": "Favorite Kinesiology Professors",
  "description": "Share experiences and recommendations for Kinesiology professors"
 },
 {
  "ID": 134,
  "space_ID": 16,
  "title": "Kinesiology Club Events",
  "description": "Stay up-to-date on Kinesiology club events and meetings"
 },
 {
  "ID": 135,
  "space_ID": 16,
  "title": "Kinesiology Research Discussions",
  "description": "Share and discuss interesting research related to Kinesiology"
 },
 {
  "ID": 136,
  "space_ID": 16,
  "title": "Summer Internships in Kinesiology",
  "description": "Discuss and share opportunities for summer internships in Kinesiology"
 },
 {
  "ID": 137,
  "space_ID": 16,
  "title": "Kinesiology Study Groups",
  "description": "Find and join study groups for Kinesiology courses"
 },
 {
  "ID": 138,
  "space_ID": 16,
  "title": "Sports Science Discussion",
  "description": "Discuss and share interesting topics and research in sports science"
 },
 {
  "ID": 139,
  "space_ID": 17,
  "title": "MCAT Study Group",
  "description": "Looking for study buddies to prepare for the MCAT"
 },
 {
  "ID": 140,
  "space_ID": 17,
  "title": "Medical School Tips",
  "description": "Share any tips you have for succeeding in medical school"
 },
 {
  "ID": 141,
  "space_ID": 17,
  "title": "Residency Matching",
  "description": "Discuss and share experiences with the residency matching process"
 },
 {
  "ID": 142,
  "space_ID": 17,
  "title": "Research Projects",
  "description": "Share your research ideas or find collaborators for your projects"
 },
 {
  "ID": 143,
  "space_ID": 17,
  "title": "Shadowing",
  "description": "Connect with other pre-med students and find shadowing opportunities"
 },
 {
  "ID": 144,
  "space_ID": 17,
  "title": "Volunteer Programs",
  "description": "Discuss volunteer programs and opportunities in the medical field"
 },
 {
  "ID": 145,
  "space_ID": 17,
  "title": "Interviews",
  "description": "Share your interview experiences and ask for advice on how to prepare for medical school interviews"
 },
 {
  "ID": 146,
  "space_ID": 17,
  "title": "Medical Conferences",
  "description": "Discuss upcoming medical conferences and events"
 },
 {
  "ID": 147,
  "space_ID": 18,
  "title": "this is a movie",
  "description": " We just had our latest cheese club meeting last night. "
 },
 {
  "ID": 148,
  "space_ID": 18,
  "title": " New Cheese Recommendations ",
  "description": " Do you have any new cheese recommendations to share? "
 },
 {
  "ID": 149,
  "space_ID": 18,
  "title": " Upcoming Tasting Event ",
  "description": " Don't miss our upcoming cheese tasting event! "
 },
 {
  "ID": 150,
  "space_ID": 18,
  "title": " Cheese of the Week ",
  "description": " This week's featured cheese is a delicious brie. "
 },
 {
  "ID": 151,
  "space_ID": 18,
  "title": " Cheese Board Inspiration ",
  "description": " Share your favorite cheese board ideas and tips here. "
 },
 {
  "ID": 152,
  "space_ID": 18,
  "title": " Favorite Cheese Pairings ",
  "description": " What are your favorite cheese and wine pairings? "
 },
 {
  "ID": 153,
  "space_ID": 18,
  "title": " Cheese Trivia Night ",
  "description": " Get ready for our upcoming cheese-themed trivia night! "
 },
 {
  "ID": 154,
  "space_ID": 18,
  "title": " Cheese-making Workshop Recap ",
  "description": " Here's a recap of our recent cheese-making workshop. "
 },
 {
  "ID": 155,
  "space_ID": 19,
  "title": "My favorite boba spot",
  "description": "Just discovered this amazing boba place downtown! Must try!"
 },
 {
  "ID": 156,
  "space_ID": 19,
  "title": "Boba recipes",
  "description": "Looking for some new recipes to try at home? Share your favorites here!"
 },
 {
  "ID": 157,
  "space_ID": 19,
  "title": "Boba meetup",
  "description": "Let's plan a boba meetup at that new spot! Who's in?"
 },
 {
  "ID": 158,
  "space_ID": 19,
  "title": "Boba reviews",
  "description": "Tried a new boba place and want to share your thoughts? Post your review here!"
 },
 {
  "ID": 159,
  "space_ID": 19,
  "title": "Boba art",
  "description": "I drew some boba art, thought I'd share with the community!"
 },
 {
  "ID": 160,
  "space_ID": 19,
  "title": "Boba news",
  "description": "Exciting news, there's a new boba place opening up in the neighborhood!"
 },
 {
  "ID": 161,
  "space_ID": 19,
  "title": "Boba memes",
  "description": "Who doesn't love boba memes? Share your favorites here!"
 },
 {
  "ID": 162,
  "space_ID": 19,
  "title": "Boba debate",
  "description": "What's the best boba flavor? Let's debate!"
 },
 {
  "ID": 163,
  "space_ID": 20,
  "title": "Need advice",
  "description": "Hi everyone! I'm currently studying abroad in Spain and I'm having trouble adjusting to the new culture. Does anyone have any advice on how to handle homesickness?"
 },
 {
  "ID": 164,
  "space_ID": 20,
  "title": "Roommate search",
  "description": "Hey everyone! I'm looking for a roommate to share an apartment with during my study abroad program in Japan. Please let me know if you're interested!"
 },
 {
  "ID": 165,
  "space_ID": 20,
  "title": "Scholarship opportunity",
  "description": "For anyone interested in studying abroad, the university is offering a scholarship for students studying in Latin America. Check it out!"
 },
 {
  "ID": 166,
  "space_ID": 20,
  "title": "Travel tips",
  "description": "Share your travel tips! What's the best way to pack for a long trip? How do you find the best flight deals? Let's help each other out."
 },
 {
  "ID": 167,
  "space_ID": 20,
  "title": "Language exchange program",
  "description": "Has anyone participated in a language exchange program before? I'm considering joining one during my study abroad program and I'd love to hear about your experiences."
 },
 {
  "ID": 168,
  "space_ID": 20,
  "title": "Cultural immersion",
  "description": "I'm currently studying abroad in China and I want to fully immerse myself in the culture. What are some recommendations for local events or activities?"
 },
 {
  "ID": 169,
  "space_ID": 20,
  "title": "Missing home",
  "description": "It's been a few weeks since I arrived in France and I'm really missing home. Any tips on how to cope with homesickness?"
 },
 {
  "ID": 170,
  "space_ID": 20,
  "title": "Host family experience",
  "description": "Has anyone stayed with a host family during their study abroad program? What was your experience like? I'm considering this option but I'm a little nervous."
 },
 {
  "ID": 171,
  "space_ID": 21,
  "title": " Welcome Grad Students! ",
  "description": "Looking for advice on how to choose the right supervisor? Share your experiences and ask for advice in this space"
 },
 {
  "ID": 172,
  "space_ID": 21,
  "title": " Advice on Choosing a Supervisor ",
  "description": "Looking for advice on how to choose the right supervisor? Share your experiences and ask for advice in this space"
 },
 {
  "ID": 173,
  "space_ID": 21,
  "title": " Conference Opportunities ",
  "description": "Share upcoming conference opportunities and discuss potential collaborations with other grad students in this space"
 },
 {
  "ID": 174,
  "space_ID": 21,
  "title": " Strategies for Time Management ",
  "description": "Discuss strategies and tips for managing your time effectively as a grad student in this space"
 },
 {
  "ID": 175,
  "space_ID": 21,
  "title": " Publishing in Academic Journals ",
  "description": "Share tips and experiences about publishing in academic journals and discuss potential collaborations with other grad students in this space"
 },
 {
  "ID": 176,
  "space_ID": 21,
  "title": "Navigating thesis",
  "description": "Share experiences and ask for advice on navigating dissertation process in this space"
 },
 {
  "ID": 177,
  "space_ID": 21,
  "title": "Social Events for Grad Students",
  "description": "Share information about upcoming social events for grad students at UWaterloo in this space"
 },
 {
  "ID": 178,
  "space_ID": 21,
  "title": "Resources for Mental Health and Wellness",
  "description": "Share resources and support for maintaining mental health and wellness during the stresses of graduate studies in this space"
 },
 {
  "ID": 179,
  "space_ID": 22,
  "title": "Just finished  1984 ",
  "description": "What's your opinion on the book?"
 },
 {
  "ID": 180,
  "space_ID": 22,
  "title": " The Alchemist ",
  "description": "Can anyone give me a brief summary of this book?"
 },
 {
  "ID": 181,
  "space_ID": 22,
  "title": "New book release",
  "description": "Has anyone read the new Stephen King book?"
 },
 {
  "ID": 182,
  "space_ID": 22,
  "title": "Book club meeting",
  "description": "Our next meeting is on Tuesday, March 15th at 7 pm."
 },
 {
  "ID": 183,
  "space_ID": 22,
  "title": "Non-fiction books",
  "description": "What's your favorite non-fiction book?"
 },
 {
  "ID": 184,
  "space_ID": 22,
  "title": "Book swap",
  "description": "Anyone interested in trading books?"
 },
 {
  "ID": 185,
  "space_ID": 22,
  "title": "Historical fiction",
  "description": "Looking for recommendations on historical fiction books"
 },
 {
  "ID": 186,
  "space_ID": 22,
  "title": "Classic literature",
  "description": "What are some of your favorite classic literature books?"
 },
 {
  "ID": 187,
  "space_ID": 23,
  "title": "Looking for a roommate",
  "description": "Hello! I am looking for a roommate for the upcoming school year. I am an arts student and would prefer to live with someone in a similar program. Please let me know if you're interested."
 },
 {
  "ID": 188,
  "space_ID": 23,
  "title": "Help with essay writing",
  "description": "I'm having trouble with an essay for my English class. Does anyone have any tips or resources they can recommend? Thanks!"
 },
 {
  "ID": 189,
  "space_ID": 23,
  "title": "Art supplies for sale",
  "description": "Hi all, I have some art supplies that I no longer need and would like to sell. I have a set of acrylic paints, brushes, and canvases. Let me know if you're interested."
 },
 {
  "ID": 190,
  "space_ID": 23,
  "title": "Volunteer opportunity",
  "description": "Hey arts students, I'm looking for volunteers for an upcoming event at the art gallery downtown. If you're interested in gaining some experience in event planning and management, please let me know."
 },
 {
  "ID": 191,
  "space_ID": 23,
  "title": "Internship opportunity",
  "description": "Hi everyone, I wanted to share an internship opportunity that I came across. It's a marketing internship with a local theatre company. Check it out if you're interested in gaining experience in marketing for the arts."
 },
 {
  "ID": 192,
  "space_ID": 23,
  "title": "Photography club",
  "description": "Hey all, I'm interested in starting a photography club for arts students. We can go on photowalks and share our work. Let me know if you're interested in joining."
 },
 {
  "ID": 193,
  "space_ID": 23,
  "title": "Artist meet-up",
  "description": "Calling all artists! Let's get together and chat about our work over coffee. We can share our work and give each other feedback. If you're interested, let me know and we'll set a date and time."
 },
 {
  "ID": 194,
  "space_ID": 23,
  "title": "Musical theatre production",
  "description": "Hi arts students, the theatre program is putting on a musical this semester and they're looking for volunteers to help with costumes, set design, and other production aspects. If you're interested, let me know and I'll put you in touch with the director."
 },
 {
  "ID": 195,
  "space_ID": 24,
  "title": "Need help with MA 137",
  "description": "Looking for a study group for MA 137."
 },
 {
  "ID": 196,
  "space_ID": 24,
  "title": "Co-op opportunities",
  "description": "Any companies hiring co-op students in the Math faculty?"
 },
 {
  "ID": 197,
  "space_ID": 24,
  "title": "Math Tutorial",
  "description": "Offering a tutorial for MATH 135\/6"
 },
 {
  "ID": 198,
  "space_ID": 24,
  "title": "Interesting research paper in Math",
  "description": "Just read an interesting paper on graph theory, anyone want to discuss?"
 },
 {
  "ID": 199,
  "space_ID": 24,
  "title": "Tips for studying in the Math faculty",
  "description": "Share tips on how to succeed in math courses"
 },
 {
  "ID": 200,
  "space_ID": 24,
  "title": "Linear Algebra resources",
  "description": "Can anyone recommend good resources for studying linear algebra?"
 },
 {
  "ID": 201,
  "space_ID": 24,
  "title": "Probability study group",
  "description": "Anyone interested in forming a probability study group?"
 },
 {
  "ID": 202,
  "space_ID": 24,
  "title": "Advice for 1A Math students",
  "description": "Any advice for first year math students?"
 },
 {
  "ID": 203,
  "space_ID": 25,
  "title": "Upcoming Events",
  "description": "Discussing upcoming events organized by the Teaching Student Association"
 },
 {
  "ID": 204,
  "space_ID": 25,
  "title": "Job Opportunities",
  "description": "Sharing job opportunities in the education sector"
 },
 {
  "ID": 205,
  "space_ID": 25,
  "title": "Conference Updates",
  "description": "Discussing updates and news from education conferences"
 },
 {
  "ID": 206,
  "space_ID": 25,
  "title": "Lesson Plan Ideas",
  "description": "Sharing and discussing lesson plan ideas for different subjects"
 },
 {
  "ID": 207,
  "space_ID": 25,
  "title": "Certification Tips",
  "description": "Tips and advice for obtaining teaching certifications"
 },
 {
  "ID": 208,
  "space_ID": 25,
  "title": "Classroom Management",
  "description": "Discussing strategies for managing a classroom effectively"
 },
 {
  "ID": 209,
  "space_ID": 25,
  "title": "Teacher Burnout",
  "description": "Discussing ways to prevent teacher burnout and maintain well-being"
 },
 {
  "ID": 210,
  "space_ID": 25,
  "title": "Professional Growth",
  "description": "Sharing resources for professional growth and development"
 },
 {
  "ID": 211,
  "space_ID": 26,
  "title": "Hi!",
  "description": "Looking for more information on the Karate space. Can anyone help me out?"
 },
 {
  "ID": 212,
  "space_ID": 26,
  "title": "Uniform",
  "description": "Does anyone know where I can purchase a karate uniform?"
 },
 {
  "ID": 213,
  "space_ID": 26,
  "title": "Practice",
  "description": "Does anyone want to practice karate together?"
 },
 {
  "ID": 214,
  "space_ID": 26,
  "title": "Instructor",
  "description": "Can anyone recommend a good karate instructor in the area?"
 },
 {
  "ID": 215,
  "space_ID": 26,
  "title": "Forms",
  "description": "Does anyone have any tips on how to master the karate forms?"
 },
 {
  "ID": 216,
  "space_ID": 26,
  "title": "Competitions",
  "description": "Is anyone planning to compete in a karate tournament soon?"
 },
 {
  "ID": 217,
  "space_ID": 26,
  "title": "Beginner",
  "description": "As a beginner, what are the best resources to learn karate?"
 },
 {
  "ID": 218,
  "space_ID": 26,
  "title": "Techniques",
  "description": "What are some advanced karate techniques that I can learn?"
 },
 {
  "ID": 219,
  "space_ID": 27,
  "title": "The founding of ancient Rome",
  "description": "What were the key events in Rome's foundation?"
 },
 {
  "ID": 220,
  "space_ID": 27,
  "title": "Roman art and architecture",
  "description": "Discuss the most notable achievements in Roman art and architecture."
 },
 {
  "ID": 221,
  "space_ID": 27,
  "title": "Life in Ancient Rome",
  "description": "What was it like to live in Ancient Rome?"
 },
 {
  "ID": 222,
  "space_ID": 27,
  "title": "Roman engineering",
  "description": "Discuss the engineering feats of the Roman Empire."
 },
 {
  "ID": 223,
  "space_ID": 27,
  "title": "The Punic Wars",
  "description": "A discussion about the Punic Wars between Rome and Carthage."
 },
 {
  "ID": 224,
  "space_ID": 27,
  "title": "The Roman Republic",
  "description": "How did the Roman Republic work?"
 },
 {
  "ID": 225,
  "space_ID": 27,
  "title": "Roman Emperors",
  "description": "Who were some of the most notable Roman Emperors?"
 },
 {
  "ID": 226,
  "space_ID": 27,
  "title": "Roman military and warfare",
  "description": "Discuss the tactics and organization of the Roman military."
 },
 {
  "ID": 227,
  "space_ID": 28,
  "title": "Job opportunities",
  "description": "Share any job opportunities you come across"
 },
 {
  "ID": 228,
  "space_ID": 28,
  "title": "Need help with resume",
  "description": "Share tips and tricks for crafting a successful resume"
 },
 {
  "ID": 229,
  "space_ID": 28,
  "title": "Interview tips",
  "description": "Share advice and experiences for successful job interviews"
 },
 {
  "ID": 230,
  "space_ID": 28,
  "title": "Company research",
  "description": "Share information and insights about companies you are interested in"
 },
 {
  "ID": 231,
  "space_ID": 28,
  "title": "Networking",
  "description": "Share tips and experiences for networking effectively"
 },
 {
  "ID": 232,
  "space_ID": 28,
  "title": "Career advice",
  "description": "Share general career advice or ask for advice from others"
 },
 {
  "ID": 233,
  "space_ID": 28,
  "title": "Career fair opportunities",
  "description": "Share information about upcoming career fairs or events"
 },
 {
  "ID": 234,
  "space_ID": 28,
  "title": "Co-op experiences and recommendations",
  "description": "Share your co-op experiences and provide recommendations for future students"
 },
 {
  "ID": 235,
  "space_ID": 29,
  "title": "Starting your own business",
  "description": "Interested in starting your own business? Let's talk!"
 },
 {
  "ID": 236,
  "space_ID": 29,
  "title": "Best books for entrepreneurs",
  "description": "Share your favorite books for business inspiration"
 },
 {
  "ID": 237,
  "space_ID": 29,
  "title": "Finding investors",
  "description": "Discussion on finding investors for your business"
 },
 {
  "ID": 238,
  "space_ID": 29,
  "title": "Business news updates",
  "description": "Share and discuss the latest business news and trends"
 },
 {
  "ID": 239,
  "space_ID": 29,
  "title": "Marketing strategies",
  "description": "Tips and tricks for marketing your business effectively"
 },
 {
  "ID": 240,
  "space_ID": 29,
  "title": "E-commerce platforms",
  "description": "Discussion on various e-commerce platforms and their pros\/cons"
 },
 {
  "ID": 241,
  "space_ID": 29,
  "title": "Financial planning",
  "description": "Talk about the financial side of running a business"
 },
 {
  "ID": 242,
  "space_ID": 29,
  "title": "Business case studies",
  "description": "Analyzing successful business case studies for inspiration"
 },
 {
  "ID": 243,
  "space_ID": 30,
  "title": "Top 10 Thrillers",
  "description": "What are the best thriller movies to watch?"
 },
 {
  "ID": 244,
  "space_ID": 30,
  "title": "Marvel vs DC",
  "description": "Which universe do you prefer and why?"
 },
 {
  "ID": 245,
  "space_ID": 30,
  "title": "Hidden Gems",
  "description": "Share your favorite underrated movies"
 },
 {
  "ID": 246,
  "space_ID": 30,
  "title": "Classic Rom-Coms",
  "description": "What are your favorite romantic comedies from the past?"
 },
 {
  "ID": 247,
  "space_ID": 30,
  "title": "Sci-Fi Discussions",
  "description": "Discuss the latest sci-fi movies and TV shows"
 },
 {
  "ID": 248,
  "space_ID": 30,
  "title": "Must-Watch Documentaries",
  "description": "What documentaries would you recommend to others?"
 },
 {
  "ID": 249,
  "space_ID": 30,
  "title": "Animated Movies",
  "description": "Share your favorite animated movies and TV shows"
 },
 {
  "ID": 250,
  "space_ID": 30,
  "title": "80's Movie Marathon",
  "description": "Let's have a movie marathon and watch classic 80's movies"
 }
]